In [74]:
#Data Exploration by Crystal Butler

#Pull in song data from final.csv file
import pandas as pd
csv_data = "Resources/pokemon.csv"

In [75]:
pokemon_df = pd.read_csv(csv_data)

In [76]:
pokemon_df.head()

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,4,Mega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,5,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

In [77]:
csv_data2 = "Resources/combats.csv"

In [78]:
battles_df = pd.read_csv(csv_data2)

In [79]:
battles_df = battles_df.sort_values('First_pokemon')

In [104]:
battles_df.head()

,First_pokemon,Second_pokemon,Winner,Battle_number,Did_the_first_pokemon_win?
15176,1,372,372,1,0
45814,1,462,462,2,0
17362,1,6,6,3,0
15251,1,649,649,4,0
4883,1,285,1,5,1

In [81]:
initial_value = 1
battles_df['Battle_number'] = range(initial_value, len(battles_df) +initial_value)

In [82]:
battles_df.head()

       First_pokemon  Second_pokemon  Winner  Battle_number
15176              1             372     372              1
45814              1             462     462              2
17362              1               6       6              3
15251              1             649     649              4
4883               1             285       1              5

In [83]:
battles_df['Did_the_first_pokemon_win?'] = (battles_df['First_pokemon'] == battles_df['Winner']).astype(int)

In [103]:
battles_df.head()

,First_pokemon,Second_pokemon,Winner,Battle_number,Did_the_first_pokemon_win?
15176,1,372,372,1,0
45814,1,462,462,2,0
17362,1,6,6,3,0
15251,1,649,649,4,0
4883,1,285,1,5,1

In [85]:
battles2_df = battles_df.copy()

In [86]:
battles2_df = battles2_df.iloc[:,[1,0,2,3]]

In [102]:
battles2_df.head()

,First_pokemon,Second_pokemon,Winner,Battle_number,Did_the_first_pokemon_win?
15176,372,1,372,1,1
45814,462,1,462,2,1
17362,6,1,6,3,1
15251,649,1,649,4,1
4883,285,1,1,5,0

In [88]:
battles2_df['Did_the_first_pokemon_win?'] = (battles2_df['Second_pokemon'] == battles2_df['Winner']).astype(int)

In [101]:
battles2_df.head()

,First_pokemon,Second_pokemon,Winner,Battle_number,Did_the_first_pokemon_win?
15176,372,1,372,1,1
45814,462,1,462,2,1
17362,6,1,6,3,1
15251,649,1,649,4,1
4883,285,1,1,5,0

In [90]:
battles2_df.rename(columns = {'Second_pokemon':'First_pokemon', 'First_pokemon':'Second_pokemon'}, inplace = True)

In [100]:
battles2_df.head()

,First_pokemon,Second_pokemon,Winner,Battle_number,Did_the_first_pokemon_win?
15176,372,1,372,1,1
45814,462,1,462,2,1
17362,6,1,6,3,1
15251,649,1,649,4,1
4883,285,1,1,5,0

In [94]:

all_battles_df = pd.concat([battles_df, battles2_df], axis=0)

In [99]:
all_battles_df = all_battles_df.sort_values('Battle_number')

In [114]:
all_battles_df.dtypes

First_pokemon                 int64
Second_pokemon                int64
Winner                        int64
Battle_number                 int32
Did_the_first_pokemon_win?    int32
dtype: object

In [120]:
merged_df = pd.merge(all_battles_df,pokemon_df, how='inner', left_on=['First_pokemon'], right_on = ['#'])
#new_df = pd.merge(all_battles_df, pokemon_df,  how='left', left_on=['A_c1','c2'], right_on = ['B_c1','c2'])
merged_df.head()

,First_pokemon,Second_pokemon,Winner,Battle_number,Did_the_first_pokemon_win?,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,372,372,1,0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,1,462,462,2,0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
2,1,6,6,3,0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
3,1,649,649,4,0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
4,1,285,1,5,1,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False

In [121]:
merged_df = merged_df.iloc[:,[3,0,6,1,2,4]]

In [125]:
merged_df.rename(columns = {'Name':'First_name'},inplace = True)
#battles2_df.rename(columns = {'Second_pokemon':'First_pokemon', 'First_pokemon':'Second_pokemon'}, inplace = True)

In [126]:
merged_df

,Battle_number,First_pokemon,First_name,Second_pokemon,Winner,Did_the_first_pokemon_win?
0,1,1,Bulbasaur,372,372,0
1,2,1,Bulbasaur,462,462,0
2,3,1,Bulbasaur,6,6,0
3,4,1,Bulbasaur,649,649,0
4,5,1,Bulbasaur,285,1,1
...,...,...,...,...,...,...
99995,46765,141,Gyarados,748,748,0
99996,47021,141,Gyarados,752,141,1
99997,48267,141,Gyarados,772,772,0
99998,48770,141,Gyarados,780,141,1
99999,49642,141,Gyarados,795,141,1

In [127]:
merged_df = pd.merge(merged_df,pokemon_df, how='inner', left_on=['Second_pokemon'], right_on = ['#'])

In [130]:
merged_df.head()

,Battle_number,First_pokemon,First_name,Second_pokemon,Winner,Did_the_first_pokemon_win?,#,Second_name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,1,Bulbasaur,372,372,0,372,Barboach,Water,Ground,50,48,43,46,41,60,3,False
1,23232,638,Gothitelle,372,638,1,372,Barboach,Water,Ground,50,48,43,46,41,60,3,False
2,24480,391,Tropius,372,372,0,372,Barboach,Water,Ground,50,48,43,46,41,60,3,False
3,23257,717,Meloetta Pirouette Forme,372,717,1,372,Barboach,Water,Ground,50,48,43,46,41,60,3,False
4,23218,558,Tepig,372,372,0,372,Barboach,Water,Ground,50,48,43,46,41,60,3,False

In [129]:
merged_df.rename(columns = {'Name':'Second_name'},inplace = True)

In [131]:
merged_df = merged_df.iloc[:,[0,1,2,3,7,4,5]]

In [134]:
merged_df = merged_df.sort_values('Battle_number')

In [135]:
merged_df

,Battle_number,First_pokemon,First_name,Second_pokemon,Second_name,Winner,Did_the_first_pokemon_win?
0,1,1,Bulbasaur,372,Barboach,372,0
15447,1,372,Barboach,1,Bulbasaur,372,1
15448,2,462,Mothim,1,Bulbasaur,462,1
148,2,1,Bulbasaur,462,Mothim,462,0
15449,3,6,Charmeleon,1,Bulbasaur,6,1
...,...,...,...,...,...,...,...
15444,49998,132,Mr. Mime,800,Volcanion,132,1
32251,49999,800,Volcanion,157,Articuno,157,0
15394,49999,157,Articuno,800,Volcanion,157,1
32659,50000,800,Volcanion,196,Ampharos,800,1
15424,50000,196,Ampharos,800,Volcanion,800,0

In [136]:
winner_df_names = merged_df.iloc[:,[0,2,4,6]]

In [137]:
winner_df_names

       Battle_number  First_name Second_name  Did_the_first_pokemon_win?
0                  1   Bulbasaur    Barboach                           0
15447              1    Barboach   Bulbasaur                           1
15448              2      Mothim   Bulbasaur                           1
148                2   Bulbasaur      Mothim                           0
15449              3  Charmeleon   Bulbasaur                           1
...              ...         ...         ...                         ...
15444          49998    Mr. Mime   Volcanion                           1
32251          49999   Volcanion    Articuno                           0
15394          49999    Articuno   Volcanion                           1
32659          50000   Volcanion    Ampharos                           1
15424          50000    Ampharos   Volcanion                           0

[100000 rows x 4 columns]